---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairDoesntReach
source: html/93e8063c-eb12-70bb-e6d2-a084f7bb2b97.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairDoesntReach Property

The multistory stair/ramp could not reach its top level with integral number of flights. Maximum number of flights below the top level is created.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultistoryStairDoesntReach { get; }
```